import React, { Component } from 'react';
import Menu from "../Menu/menu";
import EpilPicture from "../images/laser-epilation.jpg";
import CarbonPicture from "../images/carbon-pilling.jpg";
import TattoRemoval from "../images/laser-tattoo-removal.jpg";
import "./info-procedurs.css";

export default class InfoProcedurs extends Component {
  render () {
    return (
    <div className="info-procedurs-page">     
        <Menu />  
        <main className="info-procedurs-main">
          <section className="info-procedurs">
          <h2 className="info-procedurs-header">Лазерная эпиляция</h2>
          <img className="info-procedurs-img"src={EpilPicture} alt="laser epilation"/>
          <p className="info-procedurs-text">Лазерная эпиляция — это передовой и самый технологичный 
            способ удаления волос направленным световым импульсом. 
            В стержне и фолликуле волоска находится много меланина, 
            это пигментное вещество, которое хорошо поглощает волны 
            света как раз  в диапазоне лазера. При поглощении энергии 
            пигмент сильно нагревается. Из-за высокой температуры разрушаются
             близлежащая зона роста и капилляры, питающие фолликулы. 
             Через 10-20 дней волосяной стержень выпадает вместе с «корнем».</p>
          <p className="info-procedurs-text">Однако около 90% фолликулов всегда находится в состоянии покоя. 
            Поэтому требуется от 6 до 10 сеансов с промежутком в 6-8 недель. 
            Количество процедур зависит от особенностей физиологии и 
            местоположения обрабатываемого участка.</p>
            <p className="info-procedurs-text">Лазерная эпиляция позволяет избавиться от любых участков
               растительности без повреждений. На аппарате имеется специальное 
               контактное охлаждение, которое сводит болевые ощущения к минимуму. 
               Из других достоинств можно назвать:</p>
               <ul className="info-procedurs-text-ul">
                 <li>отсутствие раздражения, рубцов, высыпаний, порезов;</li>
                 <li>безопасность — не влияет на общее здоровье;</li>
                 <li>стойкий эффект —  до пяти лет;</li>
                 <li>скорость — от 10 минут (зависит от объема);</li>
                 <li>результат — заметен уже после первого посещения;</li>
                 <li>исключены аллергические реакции и врастание отдельных волосков.</li>
               </ul>
               <p className="info-procedurs-text">Противопоказания: онкологические
               и имунные заболевания, беременность, сахарный диабет, индивидуальная
               непереносимость, возраст до 18 лет, простудные заболевания в острой фазе</p>
          </section>          
          <section className="info-procedurs">
          <h2 className="info-procedurs-header">Карбоновый пилинг</h2>
          <img className="info-procedurs-img"src={CarbonPicture} alt="Carbon peeling"/>
          <p className="info-procedurs-text">Карбоновый пилинг – это косметическая 
          процедура омоложения и глубокого очищения кожи под воздействием лазера. 
           Часто эту процедуру называют «карбоновой чисткой лица» из-за 
           глубокого очищения пор и рекомендации к применению пациентам с 
           акне (не в острой стадии). Кроме этого, под лазерным 
           воздействием стимулируется выработка собственного коллагена 
           в эпидермесе благодаря чему кожа приобретает упругость.</p>
           <p className="info-procedurs-text">Главное преимущество карбонового пилинга
            лица в быстром восстановлении после процедуры. Он относится к 
            щадящему воздействию на кожу. По сравнению с другими пилингами 
            у карбонового очень мало противопоказаний и побочных эффектов,
             никаких болевых ощущений и возможность проведения процедуры круглый год.</p>
             <p className="info-procedurs-text">Для проведения карбонового пилинга
              косметолог наносит наногель, дожидается его полного высыхания, 
              и уже после начинает воздействие лазером на кожу. После 
              наносится успокаивающая маска. Вся процедура занимает 45-60 минут.</p>
               <p className="info-procedurs-text">При взаимодействии лазера 
               с наногелем происходит прогревание эпидермиса, углероды как 
               будто «взрываются», отшелушивая омертвевшие клетки. Таким
                образом обновляется кожа и очищаются поры.</p>
               <p className="info-procedurs-text">
               Карбоновый пилинг рекомендуется делать при таких проблемах кожи как следы
               после акне, повышенная жирность кожи лица, тускдый цвет лица, ярко выраженная
               пигментация, купероз, наличие камедонов, при первых признаках старения</p>
               <p className="info-procedurs-text">Противопоказания такие же как и для лазерной эпиляции</p>               
          </section>
          <section className="info-procedurs">
          <h2 className="info-procedurs-header">Лазерное удаление татуировок</h2>
          <img className="info-procedurs-img"src={TattoRemoval} alt="Carbon peeling"/>
          <p className="info-procedurs-text">Удаление татуировки происходит путем воздействия
           на краситель лазерного луча определенной длины волны, который разрушает
            гранулы пигмента, находящиеся в коже. Поглощая большое количество
             лазерной энергии, частицы красителя  распадаются на микроскопические 
             осколки, которые в последующем рассасываются.  При этом с каждой 
             процедурой татуировка становится  всё бледнее и бледнее. Лазерный луч
              послойно разрушает  гранулы красителей, расположенные в эпидермальном
               и дермальном слоях кожи, при этом не повреждая здоровые клетки вокруг.
              Распавшийся на микрофрагменты пигмент выводится через лимфатическую систему.</p>
          <p className="info-procedurs-text">Процесс выведения разрушенного красителя 
          происходит постепенно. Продолжительность процесса индивидуальна и
           составляетет примерно 30-60 дней, в зависимости от цвета, размера и 
           глубины залегания красителя. Стоит так же заметить, что каждая процедура
            может удалить лишь верхний слой пигмента. Поэтому общее количество 
            процедур зависит от глубины залегания красителя.</p>
          <p className="info-procedurs-text">Для достижения оптимального результата, 
          специалист подбирает на лазерном оборудовании наиболее подходящие параметры 
          (под индивидуальный тип кожи, цвет татуировки), которые позволят наиболее
           эффективно справиться с задачей.</p>
          <p className="info-procedurs-text">
          Удаление татуировки проходит без повреждения кожного покрова. 
          Процедура не оставляет шрамов и рубцов. Татуировка удаляется навсегда.
           Удаление татуировок неодимовым лазером не имеет побочных эффектов. 
           Этот метод настолько безопасен, что с его помощью можно удалять неудачный
            перманентный макияж губ, бровей и даже век.
          </p>
          </section>
        </main>     
    </div>    
    )    
  }  
}